# This Python file uses the following encoding: utf-8
female_names_list = ['Агнесс', 'Аннелуиза', 'Ариель', 'Аннелиза', 'Алиша', 'Астория', 'Агнесс', 'Андромеда', 'Аманда', 'Аннет', 'Аннабет', 'Амелия', 'Алисия', 'Аннабелла', 'Апполин', 'Беатрис', 'Бруклия', 'Бэтла', 'Беттиет', 'Белория', 'Бруклия', 'Бэтла', 'Барбара', 'Бармия', 'Бесс', 'Брайана', 'Бекки', 'Виктория', 'Ванесса', 'Верония', 'Василиса', 'Висконсия', 'Виндикта', 'Виола', 'Венди', 'Виолетта', 'Гвиария', 'Гелата', 'Генриетта', 'Гвиана', 'Гармония', 'Гермиона', 'Гестия', 'Гермия', 'Диана', 'Диксерита', 'Джоанна', 'Джулия', 'Джессика', 'Дитта', 'Джуди', 'Джинни', 'Даринетта', 'Дженна', 'Джейн', 'Элизабет', 'Эллиада', 'Энрика', 'Эсмеральда', 'Эзетия', 'Элеонора', 'Эланор', 'Эстер', 'Эсме', 'Эдит', 'Элис', 'Эшли', 'Элена', 'Эми', 'Энн', 'Эрико', 'Эмма', 'Элль', 'Ева', 'Жозетта', 'Жизель', 'Жанна', 'Жеана', 'Жискета', 'Жасмин', 'Зарина', 'Занвезия', 'Ирида', 'Инимика', 'Иллиада', 'Иннокентия', 'Изабель', 'Изабелла', 'Карина', 'Кира', 'Карменсита', 'Кариона', 'Катрин', 'Клер', 'Клара', 'Кларисса', 'Кларенс', 'Кассиопея', 'Калипсо', 'Ким', 'Кармен', 'Кэти', 'Кейт', 'Кристен', 'Кэри', 'Коллин', 'Кетрин', 'Кэмерон', 'Кирстен', 'Лиана', 'Люцианна', 'Лира', 'Леонора', 'Луиза', 'Ламентия', 'Лейла', 'Ламина', 'Ласкетия', 'Луна', 'Леона', 'Лиднер', 'Лив', 'Моран', 'Марианна', 'Мэйлин', 'Морин', 'Мэвен', 'Мари', 'Мэри', 'Маргарет', 'Мория', 'Мариэтта', 'Миранда', 'Мюриэль', 'Мэгги', 'Миша', 'Мисора', 'Нэнси', 'Натали', 'Наталия', 'Найтири', 'Наринэ', 'Наоми', 'Онтария', 'Офелия', 'Онерия', 'Овлиция', 'Олимпиада', 'Пенелопа', 'Палетта', 'Пиония', 'Пантеона', 'Полин', 'Птолемея', 'Персея', 'Пруденс', 'Пао', 'Пикси', 'Рамония', 'Радулга', 'Рамирия', 'Розалия', 'Рэйчел', 'Рокси', 'Роксана', 'Розали', 'Роза', 'Рене', 'Роуз', 'Рэм', 'Синтия', 'Северия', 'Селена', 'Сельвия', 'Симплиция', 'Сюзанна', 'Серенити', 'Серентия', 'Стелла', 'Сьюзен', 'Саю', 'Сильвия', 'Скарлетт', 'Селения', 'Тирис', 'Талирика', 'Титания', 'Татиана', 'Тирания', 'Талеона', 'Титания', 'Тамми', 'Тамия', 'Таомаг', 'Тринни', 'Такада', 'Уэди', 'Урания', 'Улания', 'Фулона', 'Филомена', 'Феерия', 'Фаина', 'Флора', 'Фауна', 'Фрида', 'Христина', 'Хелен', 'Хаара', 'Халле', 'Хейди', 'Хилари', 'Хизер', 'Холли', 'Чжоу', 'Чао', 'Шаэра', 'Шиетта', 'Шалия', 'Шерлиз', 'Юджия', 'Юджина', 'Юория', 'Юстана',
                     'Янна']
male_names_list = ['Аэлмар', 'Алексий', 'Аэлнесс', 'Абархам', 'Афкиллар', 'Анвиль', 'Арравел', 'Арнольд', 'Агмасс', 'Арчибальд', 'Андерс', 'Арни', 'Алекс', 'Арчи', 'Антеон', 'Альбус', 'Айбер', 'Адам', 'Бесталл', 'Боркас', 'Баэлнесс', 'Брэндон', 'Боб', 'Брандон', 'Беон', 'Бобби', 'Бурбон', 'Берадот', 'Верронн', 'Верллианн', 'Вильгельм', 'Вениамин', 'Вандон', 'Виктуар', 'Гилдримм', 'Гарри', 'Гэри', 'Гарольд', 'Гордон', 'Гаррисон', 'Гудвин', 'Джерласс', 'Джаспер', 'Дик', 'Джим', 'Доар', 'Джон', 'Диплексий', 'Джонас', 'Джек', 'Дин', 'Джордж', 'Джексон', 'Джоул', 'Джуд', 'Джекоб', 'Дэниел', 'Джейкоб', 'Джеймс', 'Эйлдар', 'Эдгар', 'Эвари', 'Эдуардо', 'Эйревелл', 'Энрики', 'Элберт', 'Энджи', 'Эльберт', 'Эгри', 'Эдвард', 'Эштон', 'Энтони', 'Жеан', 'Жан', 'Иладар', 'Иррадион', 'Иллирий', 'Ингард', 'Ивиникум', 'Каиллан', 'Кориандр', 'Кантил', 'Карлайл', 'Келлфер', 'Келлан', 'Криан', 'Коравелл', 'Кадмий', 'Кораллис', 'Кадм', 'Кассиопей', 'Люциус', 'Лонгрен', 'Люций', 'Лео', 'Луций', 'Леонард', 'Лекс', 'Леопольд', 'Лэри', 'Лас', 'Лакс', 'Луи', 'Лайт', 'Мэдисон', 'Михаэль', 'Макс', 'Мираклий', 'Майк', 'Майкл', 'Мик', 'Мел', 'Мартин', 'Маллим', 'Мэтью', 'Наиселл', 'Натаниэль', 'Нокс', 'Нур', 'Ниа', 'Оливер', 'Пармис', 'Пер', 'Поль', 'Пауль', 'Пьер', 'Питер', 'Ридесар', 'Рик', 'Родислав', 'Риордан', 'Рамерий', 'Рэд', 'Ромео', 'Рэтбоун', 'Рональд', 'Рэй', 'Ричард', 'Роберт', 'Роджер', 'Саэллат', 'Слайвер', 'Сехелис', 'Син', 'Селуанн', 'Стефан', 'Сольмир', 'Себастьян', 'Сиэль', 'Соррель', 'Стив', 'Симус', 'Седрик', 'Северус', 'Сидо', 'Стивен', 'Титаний', 'Тоберон', 'Тиберий', 'Тор', 'Тейлор', 'Улан', 'Ург', 'Уилл', 'Ферммар', 'Фаавел', 'Феофил', 'Фиделий', 'Феб', 'Харрин', 'Шон', 'Ялмир', 'Янви', 'Якоб', 'Якин']
sex_list = ["male", "female"]
feudal_staircase_list = ["noble", "peasant", "citizen"]
peasant_title_profession_dict = {"king": "король", "queen": "королева", "knight": "рыцарь", "princess": "принцесса", "prince": "принц", "duke": "граф", "shopkeeper": "торговец", "craftsman":"ремесленник",
                                 "doctor": "доктор", "peasant": "крестьянин"}
title_list = ["knight", "duke"] #"king", "queen", "prince", "princess",
profession_list = ["shopkeeper", "craftsman", "doctor"]

i = "i"
e_list = [
    "",
    "e1",
    "e2",
    "e3",
]
rus_b_list = [
    "",
    "б1",
    "б2",
]
eng_b_list = [
    "",
    "b1",
    "b2"
]
rus_v_list = [
    "",
    "в1",
    "в2",
    "в3",
]
w_list = [
    "",
    "w1",
    "w2",
    "w3",
]
rus_g = [
    "",
    "г1",
    "г2",
    "г3",
]
en_g = [
    "",
    "g1",
    "g2",
    "g3",
]
A_list = [
    "",
    "A1",
    "A2",
    "A3",
    "A4",
    "A5",
    "A6",
    "A7",
    "A8",
    "A9",
    "A10",
    "A11",
    "A12",
    "A13",
    "A14",
    "A15",
    "A16",
    "A16+",
    "A17",
    "A17+",
    "A18",
    "A19",
]
a_list = [
    "",
    "a1",
    "a2",
    "a3",
    "a4",
    "a5",
    "a6",
]
rus_V_list = [
    "",
    "В1",
    "В2",
    "В3",
    "В4",
    "В5",
    "В6",
    "В7",
]
C = [
    "",
    "С",
    "С*",
    "С**",
]
arrow_up = "{"
rus_D_list = [
    "",
    "Д1",
    "Д2",
    "Д3",
    "Д4",
    "Д5",
    "Д6",
    "Д7",
    "Д7*",
    "д7",
    "Д8",
    "Д9",
    "Д10",
]

rus_G_list = [
    "",
    "Г1",
    "Г2",
    "Г3",
    "Г4",
    "Г5",
    "Г6+",
    "Г7",
    "Г10",
]
Z_list = [
    "",
    "Z1",
    "Z2",
    "Z3",
    "Z4",
    "Z5",
    "Z6",
    "Z7",
    "Z8",
    "Z9",
]
R_list = [
    "",
    "R1",
    "R2",
    "R3",
    "R4",
    "R5",
    "R6",
]
rus_B_list = [
    "",
    "Б1",
    "Б2",
]
rus_P_list = [
    "",
    "П1",
    "П2",
    "П3",
    "П4",
    "П5",
    "П6",
]
K_list = [
    "",
    "K1",
    "K2",
    "K3",
]
rus_L_list = [
    "",
    "Л1",
    "Л2",
    "Л3",
    "Л4",
    "Л5",
    "Л6",
    "Л7",
    "Л8",
    "Л9",
    "Л10",
]
arrow_down = "}"

pr_list = [
    "",
    "Пр1",
    "Пр2",
    "Пр3",
    "Пр4",
    "Пр5",
    "Пр6",
    "Пр7",
]
Sp_list = [
    "",
    "Сп1",
    "Сп2",
    "Сп3",
    "Сп4",
    "Сп5",
    "Сп6",
    "Сп7",
    "Сп8",
    "Сп9",
    "Сп10",
]
ruz_H = "H"
rus_F = "Ф"
rus_Z = "З"
rus_R = "Р"
T_list = [
    "",
    "T1",
    "T2",
    "T3",
    "T4",
]
left_arrow = "<--"
s = "s"
mot = "mot"
con = "con"
Pos = "Pos"
neg = "neg"
contr = "contr"

weapon = '''
Боевой посох	 
Булава	
Дубинка	
Кинжал	
Копьё	
Лёгкий молот
Метательное копьё
Палица	
Ручной топор	
Серп	
Арбалет, лёгкий	
Дротик	
Короткий лук	
Праща	
Алебарда	
Боевая кирка	
Боевой молот	
Боевой топор	
Глефа	
Двуручный меч	
Длинное копьё	
Длинный меч		
Кнут	
Короткий меч	
Молот	
Моргенштерн	
Пика	 
Рапира	
Секира		
Скимитар		
Трезубец		
Цеп	
Арбалет
Длинный лук
Духовая трубка	
Сеть'''

weapon_list = [
    "dagger",
    "sword",
    "mace",
    "lance",
    "hammer",
    "bow",
    "crossbow"
]

jewelry_list = [
    "bracelet", "brooch", "beads", "tiara", "crown", "ring", "necklace", "earrings"
]

world_elements = ["forest", "water", "fire", "ice", "magic", "sunlight", "moonlight"]
animal_species = ["ships", "cows", "horses", "pigs", "wolves", "foxes", "bears"]
flora = ["flowers", "spruces"]
evils = ["vampire", "lich", "giant", "troll", "giant", "wizard", "dragon"]
